[
  {
    "title": "What is SLA, SLI and SLO's?",
    "description": "Here's the difference between SLI, SLO, and SLA.",
    "authorGitHubUsername": "devneelpatel",
    "tags": ["Learning Resource", "Site Reliability Engineering"],
    "post": "2023-06-12-sli-sla-slo"
  },
  {
    "title": "Why we dont like TDD: A Developer’s Perspective",
    "description": "Test-Driven Development (TDD) is a software practice emphasizing writing tests before code. Many find drawbacks in committing to an API prematurely and hindering exploration during early development. ",
    "authorGitHubUsername": "devneelpatel",
    "tags": ["Tests"],
    "post": "2023-11-21-why-we-dont-like-tdd"
  },
  {
    "title": "How to configure MetalLB with Kubernetes (Microk8s).",
    "description": "MetalLB is a load-balancer implementation for bare metal Kubernetes clusters, using standard routing protocols. Learn how to configure MetalLB with Kubernetes (Microk8s).",
    "authorGitHubUsername": "devneelpatel",
    "tags": ["Kubernetes", "Microk8s"],
    "post": "2023-11-06-configure-metallb-with-kubernetes-microk8s"
  },
  {
    "title": "How moving from AWS to Bare-Metal saved us $230,000 /yr.",
    "description": "How technologies like Docker, Kubernetes, Helm, Microk8s, Ceph and more make transitioning to bare-metal infrastructure significantly easier than it was just a few years ago.",
    "authorGitHubUsername": "devneelpatel",
    "tags": ["Cloud", "AWS"],
    "post": "2023-10-30-moving-from-aws-to-bare-metal"
  },
  {
    "title": "Why build open-source DataDog?",
    "description": "Building an open-source alternative to Datadog enhances cost-efficiency, observability, and data privacy, offering a net-positive impact on the software world.",
    "authorGitHubUsername": "devneelpatel",
    "tags": ["DataDog", "Open Source"],
    "post": "2024-08-14-why-build-open-source-datadog"
  },
  {
    "title": "Kubernetes Storage Layers: Ceph vs. Longhorn vs. Everything Else",
    "description": "A decision guide to Ceph/Rook, Longhorn, OpenEBS, Portworx, and cloud-managed volumes-covering architectures, failure drills, and how to match each option to your workloads.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Kubernetes", "Storage", "Ceph", "Bare Metal", "Cloud", "DevOps"],
    "post": "2025-11-27-choosing-kubernetes-storage-layers"
  },
  {
    "title": "Monitoring LLM Application(s) with Openlit and OneUptime",
    "description": "How to monitor LLMs using tools like Openlit & OpenTelemetry to ensure accurate outputs, improve data retrieval, and optimize costs, with OneUptime for visualizing performance metrics.",
    "authorGitHubUsername": "AmanAgarwal041",
    "tags": ["LLM Observability", "Openlit", "OpenTelemetry"],
    "post": "2024-09-13-monitoring-llm-with-openlit-and-oneuptime"
  },
  {
    "title": "How to name spans in OpenTelemetry?",
    "description": "Here's how to craft meaningful span names that enhance your observability efforts, making debugging and performance tuning a breeze. From best practices to advanced strategies, this guide covers it all. ",
    "authorGitHubUsername": "devneelpatel",
    "tags": ["Tracing", "OpenTelemetry"],
    "post": "2024-11-04-how-to-name-spans-in-opentelemetry"
  },
  {
    "title": "How to increase the size of the sending queue in OpenTelemetry Collector?",
    "description": "Sometimes your OpenTelemetry Collector might not be able to send all the data to the backend. This is because the sending queue is full. This post will help you increase the size of the sending queue.",
    "authorGitHubUsername": "devneelpatel",
    "tags": ["OpenTelemetry"],
    "post": "2025-01-20-increase-size-of-open-telemetry-collector-queue"
  },
  {
    "title": "How to collect internal metrics from OpenTelemetry Collector?",
    "description": "Sometimes your OpenTelemetry Collector might not be able to send all the data to the backend. This is because the sending queue is full. This post will help you increase the size of the sending queue.",
    "authorGitHubUsername": "devneelpatel",
    "tags": ["OpenTelemetry"],
    "post": "2025-01-22-how-to-collect-opentelemetry-collector-internal-metrics"
  },
  {
    "title": "Integrating OneUptime and Slack (and probably Teams)",
    "description": "Learn how to use workflows to send messages to Slack when incidents are created or updated.",
    "authorGitHubUsername": "mikepearce",
    "tags": ["Workflows", "Slack", "Components", "JSON"],
    "post": "2025-01-31-integrating-oneuptime-and-slack-and-probably-teams"
  },
  {
    "title": "Datadog Dollars: Why Your Monitoring Bill Is Breaking the Bank",
    "description": "Have you ever opened your monitoring bill and felt your heart skip a beat? You're not alone. In the world of digital infrastructure, many companies are experiencing sticker shock when they see their Datadog invoices. Let's unpack why your monitoring bill might be breaking the bank and explore how you can rein it back in.",
    "authorGitHubUsername": "devneelpatel",
    "tags": ["Observability", "Datadog"],
    "post": "2025-02-01-datadog-dollars-why-monitoring-is-breaking-the-bank"
  },
  {
    "title": "The Power of Three: How Small Teams Drive Big Results at OneUptime",
    "description": "We have found that keeping teams small and focused isnt just efficient -  its transformative. Here is how this approach helped us deliver platforms rivaling the scope of Incident.io, StatusPage.io, and more- all with just two tiny teams.",
    "authorGitHubUsername": "devneelpatel",
    "tags": ["Team Management", "Startups"],
    "post": "2025-03-13-power-of-three-how-small-teams-drive-big-results"
  },
  {
    "title": "Introducing OneUptime MCP Server: Bringing AI-Native Observability to Your Workflow",
    "description": "OneUptime now provides a production-ready Model Context Protocol (MCP) server that gives AI assistants direct access to your observability infrastructure. Create incidents, query logs, manage monitors, and automate operations- all through natural language conversations with AI.",
    "authorGitHubUsername": "devneelpatel",
    "tags": [
      "MCP",
      "AI",
      "Model Context Protocol",
      "Open Source",
      "Observability",
      "Automation"
    ],
    "post": "2025-07-01-oneuptime-mcp-server-ai-observability"
  },
  {
    "title": "OneUptime Embraces Open Standards: Complete OpenAPI 3.0 Specification Now Available",
    "description": "OneUptime now provides a comprehensive OpenAPI 3.0 specification covering our entire API surface. This commitment to open standards enables seamless integrations, third-party tool development, and demonstrates our dedication to interoperability in the open source ecosystem.",
    "authorGitHubUsername": "devneelpatel",
    "tags": ["OpenAPI", "Open Source", "Standards", "Interoperability", "API"],
    "post": "2025-07-01-oneuptime-openapi-specification-open-standards"
  },
  {
    "title": "Introducing the OneUptime Terraform Provider: Infrastructure as Code for Complete Observability",
    "description": "We're excited to announce the release of the official OneUptime Terraform provider! Now you can manage your entire observability infrastructure as code, from uptime monitors and status pages to incident management workflows and on-call schedules.",
    "authorGitHubUsername": "devneelpatel",
    "tags": ["Infrastructure as Code", "Terraform", "DevOps", "Automation"],
    "post": "2025-07-01-introducing-terraform-provider-for-oneuptime"
  },
  {
    "title": "Native apps had a good run, but PWA has caught up and is the future.",
    "description": "Native apps had a good run, but the web has caught up. Here's why PWAs now outperform traditional native app strategies for most SaaS platforms- and why OneUptime intentionally chose a single PWA-first codebase instead of separate iOS and Android apps.",
    "authorGitHubUsername": "devneelpatel",
    "tags": ["PWA", "Web Architecture", "Product", "Platform Strategy"],
    "post": "2025-08-19-native-apps-had-a-good-run-but-pwa-has-caught-up-and-is-the-future"
  },
  {
    "title": "Stop Paywalling Security: SSO Is a Basic Right, Not an Enterprise Perk",
    "description": "Too many SaaS and open-source products still hide SSO behind an enterprise plan. Here's why SSO, SCIM, and 2FA must be baseline security- not monetization levers- and how OneUptime approaches pricing differently.",
    "authorGitHubUsername": "devneelpatel",
    "tags": ["Security", "SaaS", "Open Source", "Identity"],
    "post": "2025-08-19-sso-is-a-security-basic-not-an-enterprise-perk"
  },
  {
    "title": "Logs, Metrics & Traces: A Before and After Story.",
    "description": "A journey from firefighting in the dark to calm, data-driven operations by unifying metrics, logs, and traces with OpenTelemetry.",
    "authorGitHubUsername": "devneelpatel",
    "tags": [
      "Observability",
      "OpenTelemetry",
      "Logs",
      "Metrics",
      "Traces",
      "Open Source"
    ],
    "post": "2025-08-21-logs-traces-metrics-before-and-after"
  },
  {
    "title": "Traces vs Metrics in Software Observability",
    "description": "Metrics tell you what changed. Traces tell you where. Logs tell you why. How to design each signal intentionally with OpenTelemetry and avoid wasted spend.",
    "authorGitHubUsername": "devneelpatel",
    "tags": [
      "Observability",
      "OpenTelemetry",
      "Metrics",
      "Traces",
      "Logs",
      "Open Source"
    ],
    "post": "2025-08-21-traces-vs-metrics-in-opentelemetry"
  },
  {
    "title": "Why Engineers Should Spend a Day Each Week in Support & Sales",
    "description": "Embedding engineers directly into customer support and sales one day a week compounds product quality, empathy, velocity, and credibility with a deeply technical buyer.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Product",
      "Team Management",
      "Startups",
      "Engineering Culture",
      "Customer Support",
      "Sales"
    ],
    "post": "2025-08-22-why-engineers-should-spend-20-percent-of-time-talking-to-customers"
  },
  {
    "title": "How to reduce noise in OpenTelemetry? Keep What Matters, Drop the Rest.",
    "description": "A practical guide to reducing telemetry noise with OpenTelemetry- curating metrics, tail sampling traces, structured log policies, and SLO-first alerting to surface only what accelerates MTTR.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Observability",
      "OpenTelemetry",
      "Logs",
      "Metrics",
      "Traces",
      "Sampling",
      "SLOs",
      "Cardinality",
      "Alerting",
      "Cost Optimization"
    ],
    "post": "2025-08-25-how-to-reduce-noise-in-opentelemetry"
  },
  {
    "title": "What are metrics in OpenTelemetry: A Complete Guide",
    "description": "A comprehensive guide to understanding metrics in OpenTelemetry- what they are, how they work, and how to implement them effectively in TypeScript/Node.js applications with practical code examples.",
    "authorGitHubUsername": "devneelpatel",
    "tags": [
      "OpenTelemetry",
      "Metrics",
      "Observability",
      "TypeScript",
      "NodeJS",
      "Monitoring"
    ],
    "post": "2025-08-26-what-are-metrics-in-opentelemetry"
  },
  {
    "title": "What are Traces and Spans in OpenTelemetry: A Practical Guide",
    "description": "A comprehensive, code-heavy guide to understanding traces and spans in OpenTelemetry- how they work, how they relate, and how to instrument real Node.js / TypeScript applications effectively for deep insight and faster debugging.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "OpenTelemetry",
      "Tracing",
      "Traces",
      "Observability",
      "TypeScript",
      "NodeJS"
    ],
    "post": "2025-08-27-traces-and-spans-in-opentelemetry"
  },
  {
    "title": "How to Structure Logs Properly in OpenTelemetry: A Complete Guide",
    "description": "A comprehensive guide to structuring logs properly in OpenTelemetry- mastering log correlation with traces, effective attribute usage, and implementing structured logging patterns that enhance debugging and observability.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "OpenTelemetry",
      "Logs",
      "Logging",
      "Observability",
      "TypeScript",
      "NodeJS",
      "Structured Logging",
      "Correlation"
    ],
    "post": "2025-08-28-how-to-structure-logs-properly-in-opentelemetry"
  },
  {
    "title": "Why We Resent Middle Managers (And Why OneUptime Doesn't Have Any)",
    "description": "Middle managers have become the organizational equivalent of technical debt- layers that slow everything down without adding clear value. At OneUptime, we've intentionally eliminated middle management in favor of direct leadership and autonomous teams. Here's why this approach drives better results, happier engineers, and faster innovation.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Team Management",
      "Engineering Culture",
      "Leadership",
      "Organizational Design",
      "Startups"
    ],
    "post": "2025-08-29-why-we-resent-middle-managers-and-why-we-dont-have-them"
  },
  {
    "title": "The Five Stages of SRE Maturity: From Chaos to Operational Excellence",
    "description": "Site Reliability Engineering (SRE) isn't a destination- it's a journey. Most organizations evolve through predictable stages of maturity, from alert-ignoring chaos to perfectly oiled operations that rarely breach error budgets. This post outlines the five stages of SRE maturity and how to progress through them.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Site Reliability Engineering",
      "SRE",
      "Observability",
      "DevOps",
      "SLOs",
      "Error Budgets",
      "Incident Management"
    ],
    "post": "2025-09-01-the-five-stages-of-sre-maturity"
  },
  {
    "title": "The Hidden Costs of Dependency Bloat in Software Development",
    "description": "Dependency bloat isn't just about bundle size- it's a hidden tax on your development velocity, security posture, and long-term maintainability. Learn why fewer dependencies often means faster, safer, and more sustainable software.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Software Development", "Dependencies", "Maintenance", "Security"],
    "post": "2025-09-02-the-hidden-costs-of-dependency-bloat-in-software-development"
  },
  {
    "title": "What are Error Budgets? A Guide to Managing Reliability",
    "description": "Error budgets are a fundamental concept in Site Reliability Engineering that help teams balance innovation with reliability. This guide explains what error budgets are, how to manage them effectively, what to look out for, and how they differ from SLOs.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Site Reliability Engineering",
      "SRE",
      "Observability",
      "SLOs",
      "Error Budgets",
      "Reliability"
    ],
    "post": "2025-09-03-what-are-error-budgets"
  },
  {
    "title": "Understanding MTTR, MTTD, MTBF and the Complete Reliability Lexicon",
    "description": "A comprehensive guide to essential SRE metrics including MTTR, MTTD, MTTF, MTBF, error budgets, SLOs, and advanced reliability concepts. Learn how to implement metrics-driven reliability practices that go beyond simple uptime measurements.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Site Reliability Engineering",
      "SRE",
      "Observability",
      "MTTR",
      "MTTD",
      "SLOs",
      "Error Budgets",
      "Reliability",
      "Metrics",
      "Incident Management"
    ],
    "post": "2025-09-04-what-is-mttr-mttd-mtbf-and-more"
  },
  {
    "title": "Why 'AI content = Bad' is a flawed mindset",
    "description": "The knee-jerk reaction to dismiss anything created by AI is fundamentally flawed. Quality should be judged by output, not by origin. When AI helps engineers write better code, produce more content, and eliminate grunt work, the real question isn't \"was this made by AI?\" but \"does this solve the problem effectively?\"",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "AI",
      "Software Development",
      "Engineering Culture",
      "Product Development",
      "Productivity"
    ],
    "post": "2025-09-05-why-ai-content-bad-is-a-flawed-mindset"
  },
  {
    "title": "Lessons from npm's Security Failures",
    "description": "Recent npm security incidents reveal fundamental flaws in package manager design. Here's how every package manager should implement security measures to prevent supply chain attacks and protect developers.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Security",
      "Package Management",
      "Supply Chain",
      "DevOps",
      "Dependencies",
      "Open Source"
    ],
    "post": "2025-09-09-lessons-from-npm-security-failures"
  },
  {
    "title": "Effective Incident Postmortem Templates: Ready-to-Use Examples",
    "description": "Master incident postmortems with these ready-to-use templates. Learn how to structure effective postmortems to improve reliability and prevent future incidents.",
    "authorGitHubUsername": "devneelpatel",
    "tags": ["Incident Management", "Postmortems", "Templates", "Reliability"],
    "post": "2025-09-09-effective-incident-postmortem-templates-ready-to-use-examples"
  },

  {
    "title": "Basics of profiling: Turning CPU & Memory Hotspots into Action",
    "description": "A practical guide to continuous profiling, why you need it beyond logs/metrics/traces, core profile types, how to collect CPU & heap profiles in Node.js, and how to correlate them with traces for faster performance debugging.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "OpenTelemetry",
      "Profiling",
      "Observability",
      "Performance",
      "NodeJS",
      "TypeScript",
      "Tracing"
    ],
    "post": "2025-09-09-basics-of-profiling"
  },
  {
    "title": "The Ultimate SRE Reliability Checklist: From Chaos to Consistent Excellence",
    "description": "A comprehensive, opinionated SRE checklist spanning culture, SLOs, observability, alerting, incidents, change management, resilience, automation, cost and continuous improvement- use it as a maturity roadmap.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Site Reliability Engineering",
      "SRE",
      "Observability",
      "Reliability",
      "Incident Management",
      "SLOs",
      "Error Budgets",
      "DevOps",
      "Automation",
      "Metrics",
      "Postmortems"
    ],
    "post": "2025-09-10-sre-checklist"
  },
  {
    "title": "P50 vs P95 vs P99 Latency: What These Percentiles Actually Mean",
    "description": "A practical guide to understanding P50, P95, and P99 latency percentiles- why averages lie, what each percentile tells you about user experience, how to set SLOs around them, and how to collect them correctly with histograms.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Observability",
      "Performance",
      "Metrics",
      "Latency",
      "SLOs",
      "Site Reliability Engineering",
      "SRE",
      "Reliability"
    ],
    "post": "2025-09-15-p50-vs-p95-vs-p99-latency-percentiles"
  },
  {
    "title": "OpenTelemetry Collector: What It Is, When You Need It, and When You Don’t",
    "description": "A practical guide to understanding the OpenTelemetry Collector- what it does, architecture patterns with and without it, and a decision framework for when to deploy it to improve performance, cost, security, and flexibility.",
    "authorGitHubUsername": "devneelpatel",
    "tags": [
      "OpenTelemetry",
      "Observability",
      "Metrics",
      "Logs",
      "Traces",
      "Collector",
      "Cost Optimization",
      "Reliability",
      "Sampling"
    ],
    "post": "2025-09-18-what-is-opentelemetry-collector-and-why-use-one"
  },
  {
    "title": "Connecting Metrics ↔ Traces with Exemplars in OpenTelemetry",
    "description": "A hands-on guide to exemplars- how they connect metric points to the exact trace that caused them, why they matter for faster debugging and cost efficiency, and how to enable them end-to-end with OpenTelemetry (apps → collector → backend).",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "OpenTelemetry",
      "Metrics",
      "Traces",
      "Exemplars",
      "Correlation",
      "Histograms",
      "Performance"
    ],
    "post": "2025-09-22-connecting-metrics-to-traces-with-exemplars"
  },
  {
    "title": "How to monitor SSL Certificate with OneUptime: Never Let a Certificate Expire Again",
    "description": "A comprehensive guide to monitoring SSL certificates with OneUptime- from setup and configuration to advanced monitoring scenarios. Learn how to prevent certificate expiration outages, track certificate health, and set up intelligent alerting for your SSL infrastructure.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "SSL",
      "TLS",
      "Certificate Monitoring",
      "Security",
      "Monitoring",
      "Infrastructure",
      "DevOps",
      "Reliability",
      "Uptime Monitoring"
    ],
    "post": "2025-09-23-ssl-certificate-monitoring-with-oneuptime"
  },
  {
    "title": "Monitoring IoT Devices with OneUptime: Keep Your Connected Devices in Check",
    "description": "A comprehensive guide to monitoring IoT devices with OneUptime's incoming request monitors. Learn how to set up heartbeat monitoring for your connected devices, configure alerts, and ensure your IoT infrastructure stays reliable.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "IoT",
      "Monitoring",
      "Incoming Request",
      "Heartbeat",
      "Devices",
      "Reliability",
      "DevOps"
    ],
    "post": "2025-09-24-monitoring-iot-devices-with-oneuptime"
  },
  {
    "title": "Monitoring Backup Jobs with OneUptime: Ensure Your Backups Actually Work",
    "description": "A comprehensive guide to monitoring backup jobs with OneUptime's incoming request monitors. Learn how to track backup job status, detect failures, and ensure your data protection strategy works when you need it most.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Backup",
      "Monitoring",
      "Incoming Request",
      "Heartbeat",
      "Jobs",
      "Reliability",
      "DevOps",
      "Data Protection",
      "Automation"
    ],
    "post": "2025-09-25-monitoring-backup-jobs-with-oneuptime"
  },
  {
    "title": "Integrating Grafana Alerts with OneUptime: Automated Incident Management",
    "description": "A comprehensive guide to integrating Grafana alerts with OneUptime's incoming request monitors. Learn how to automatically create incidents, update status pages, and trigger on-call rotations when Grafana detects issues.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Grafana",
      "Alerts",
      "Monitoring",
      "Incoming Request",
      "Heartbeat",
      "Status Page",
      "On-call",
      "Incident Management",
      "DevOps",
      "Webhooks",
      "Automation"
    ],
    "post": "2025-09-26-integrating-grafana-alerts-with-oneuptime"
  },
  {
    "title": "Mastering APM: End-to-End User Journey Tracing in Distributed Systems",
    "description": "A practical, end-to-end guide to propagating trace IDs across microservices- HTTP, gRPC, queues, and background jobs- so you can reconstruct real user journeys with OpenTelemetry, W3C Trace Context, and smart sampling.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "APM",
      "OpenTelemetry",
      "Tracing",
      "Traces",
      "Observability",
      "Distributed Systems",
      "Trace Context",
      "Sampling",
      "Correlation"
    ],
    "post": "2025-10-01-mastering-apm-tracing-user-journeys-in-distributed-systems"
  },
  {
    "title": "Synthetic Monitoring in OneUptime: Simulating Real User Journeys with Playwright",
    "description": "How OneUptime implements synthetic monitoring using real browsers, sandboxed user scripts, multi-device/multi-browser matrices, and rich artifacts (logs, screenshots) to proactively validate user journeys before your customers do.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Synthetic Monitoring",
      "Monitoring",
      "Reliability",
      "Performance",
      "Customer Experience",
      "Playwright",
      "Uptime Monitoring",
      "DevOps"
    ],
    "post": "2025-10-01-synthetic-monitoring-in-oneuptime-simulating-real-user-journeys-with-playwright"
  },
  {
    "title": "Eliminating Toil: A Practical SRE Playbook",
    "description": "What toil really is (and isn’t), how to find and measure it, and pragmatic steps to eliminate it with automation, guardrails, and culture.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Site Reliability Engineering",
      "SRE",
      "Toil",
      "Automation",
      "DevOps",
      "Observability",
      "On-call",
      "Runbooks"
    ],
    "post": "2025-10-01-what-is-toil-and-how-to-eliminate-it"
  },
  {
    "title": "DevOps - Here's a brief ode to the unsung heroes",
    "description": "A brief thank-you to the DevOps teams who helped us keep systems steady when hyperscalers like AWS stumble.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["DevOps", "Site Reliability Engineering", "Reliability", "AWS"],
    "post": "2025-10-21-ode-to-devops-heroes"
  },
  {
    "title": "Why AWS us-east-1 Should Be Your Region of Last Resort",
    "description": "us-east-1 keeps reminding us that \"default\" is not the same as resilient. This post explains why the region fails so loudly, how its control planes and vendor ecosystem amplify outages, and the practical steps to escape the blast radius.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "AWS",
      "Cloud",
      "Reliability",
      "Incident Management",
      "Disaster Recovery"
    ],
    "post": "2025-10-21-aws-us-east-1-region-of-last-resort"
  },
  {
    "title": "The Internet Must Decentralize",
    "description": "Yesterday's AWS outage reminded us that resilience starts at the edges. Here is why decentralizing and self-hosting your core services matters.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Cloud", "AWS", "Decentralization", "Self-Hosting", "Reliability"],
    "post": "2025-10-21-the-internet-must-decentralize"
  },
  {
    "title": "Monitor Every IP Address with OneUptime",
    "description": "A practical guide to configuring IP monitors in OneUptime, including IPv4/IPv6 validation, smart probe fallbacks, and alert automation.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Monitoring",
      "Infrastructure",
      "IP Monitoring",
      "Reliability",
      "Uptime Monitoring",
      "DevOps"
    ],
    "post": "2025-10-27-monitor-ip-addresses-with-oneuptime"
  },
  {
    "title": "Keep Critical Ports Alive with OneUptime",
    "description": "How OneUptime's port monitors validate configuration, time TCP handshakes, and automate incidents when service ports stop responding.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Monitoring",
      "Infrastructure",
      "Port Monitoring",
      "Reliability",
      "Uptime Monitoring",
      "DevOps"
    ],
    "post": "2025-10-27-monitor-service-ports-with-oneuptime"
  },
  {
    "title": "Monitor Logs with OneUptime",
    "description": "Turn log queries into automated guardrails with OneUptime's log monitors, complete with live previews, scheduled counts, and incident automation.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Monitoring", "Observability", "Logs", "Logging", "DevOps"],
    "post": "2025-10-27-monitor-logs-with-oneuptime"
  },
  {
    "title": "Monitor Traces with OneUptime",
    "description": "A deep dive into OneUptime's trace monitors - span queries, rolling windows, status filters, and automated incidents for distributed systems.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Monitoring",
      "Observability",
      "Tracing",
      "Traces",
      "DevOps",
      "OpenTelemetry"
    ],
    "post": "2025-10-27-monitor-traces-with-oneuptime"
  },
  {
    "title": "Monitor Metrics with OneUptime",
    "description": "Use OneUptime's metric monitors to run rolling aggregations, apply formulas, and trigger automated incidents when telemetry drifts.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Monitoring",
      "Observability",
      "Metrics",
      "DevOps",
      "OpenTelemetry"
    ],
    "post": "2025-10-27-monitor-metrics-with-oneuptime"
  },
  {
    "title": "Connect OneUptime to Microsoft Teams",
    "description": "Set up the OneUptime integration for Microsoft Teams so incidents, alerts, and status updates reach the right channel instantly.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Monitoring",
      "Incident Management",
      "Integrations",
      "Microsoft Teams",
      "On-call",
      "Workflows",
      "Automation"
    ],
    "post": "2025-10-27-integrate-microsoft-teams-with-oneuptime"
  },
  {
    "title": "Why You Need a Status Page (Long Before Your Next Incident)",
    "description": "Learn why proactive communication beats silence, how status pages reduce ticket volume, and the signals that tell you it is time to launch one.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Status Page",
      "Customer Experience",
      "Reliability",
      "Incident Management"
    ],
    "post": "2025-10-27-why-you-need-a-status-page"
  },
  {
    "title": "Create a Public Status Page with OneUptime",
    "description": "Step-by-step instructions to brand, automate, and launch a customer-facing status page that keeps everyone informed during incidents and maintenance.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Status Page",
      "Customer Experience",
      "Incident Management",
      "Reliability"
    ],
    "post": "2025-10-27-create-a-public-status-page-with-oneuptime"
  },
  {
    "title": "Create a Private Status Page with OneUptime",
    "description": "Configure access controls, SSO, and tailored messaging for internal or premium audiences using OneUptime private status pages.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Status Page", "Incident Management", "Reliability", "Security"],
    "post": "2025-10-27-create-a-private-status-page-with-oneuptime"
  },
  {
    "title": "Plan Scheduled Maintenance with OneUptime",
    "description": "Plan, approve, and communicate scheduled maintenance without surprising customers or internal teams.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Scheduled Maintenance",
      "Status Page",
      "Incident Management",
      "Customer Experience"
    ],
    "post": "2025-10-27-manage-scheduled-maintenance-with-oneuptime"
  },
  {
    "title": "Organize Your Service Catalog with OneUptime",
    "description": "Build a living inventory of services, owners, monitors, and dependencies using OneUptime’s Service Catalog.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Service Catalog", "Reliability", "Ownership", "Dependencies"],
    "post": "2025-10-27-service-catalog-with-oneuptime"
  },
  {
    "title": "AWS to Bare Metal Two Years Later: Answering Your Toughest Questions About Leaving AWS",
    "description": "Two years after leaving AWS we revisit the numbers, share what changed, and address the biggest questions from Hacker News and r/sysadmin.",
    "authorGitHubUsername": "devneelpatel",
    "tags": ["AWS", "Cloud", "Infrastructure", "Cost Optimization"],
    "post": "2025-10-29-aws-to-bare-metal-two-years-later"
  },
  {
    "title": "Kubernetes + Ceph: Your Freedom from the Cloud Cartel",
    "description": "Kubernetes standardizes compute, Ceph standardizes storage. Together they make cloud-to-cloud, hybrid, and bare metal moves routine while weakening the hyperscaler oligopoly.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Kubernetes",
      "Ceph",
      "Bare Metal",
      "Cloud",
      "Infrastructure",
      "Self-Hosting"
    ],
    "post": "2025-11-03-kubernetes-and-ceph-break-the-cloud-cartel"
  },
  {
    "title": "OpenTelemetry: Your Escape Hatch from the Observability Cartel",
    "description": "OpenTelemetry standardizes instrumentation and pipelines so you can swap observability vendors, mix open source with commercial tools, and run hybrid data stacks without paying exit taxes.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "OpenTelemetry",
      "Observability",
      "Open Source",
      "Vendor Lock-in",
      "Telemetry Pipeline"
    ],
    "post": "2025-11-03-opentelemetry-escape-from-observability-cartel"
  },
  {
    "title": "OneUptime Now Speaks Syslog Natively: Bring Legacy Logs into Modern Observability",
    "description": "Forward RFC3164 and RFC5424 syslog directly into OneUptime over HTTPS, explore common deployment patterns, and start alerting on the data instantly.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Monitoring",
      "Observability",
      "Logs",
      "Logging",
      "Syslog",
      "DevOps"
    ],
    "post": "2025-11-06-native-syslog-support-in-oneuptime"
  },
  {
    "title": "Kubernetes Is Your Private Cloud: Own Your Stack, Own Your Future",
    "description": "Kubernetes already delivers every cloud building block - compute, storage, databases, AI - on hardware you control, giving you sovereignty over costs, compliance, and velocity.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Kubernetes",
      "Self-Hosting",
      "Bare Metal",
      "Cloud",
      "Vendor Lock-in",
      "Private Cloud"
    ],
    "post": "2025-11-12-kubernetes-is-your-private-cloud"
  },
  {
    "title": "Keep PII Out of Your Telemetry: Sanitizing Logs, Traces, and Metrics with OpenTelemetry",
    "description": "A step-by-step playbook for preventing sensitive data from leaking into logs, traces, and metrics using OpenTelemetry SDKs, collector processors, and automated detection.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "OpenTelemetry",
      "Security",
      "Data Protection",
      "Logs",
      "Metrics",
      "Traces",
      "PII",
      "Compliance"
    ],
    "post": "2025-11-13-keep-pii-out-of-observability-telemetry"
  },
  {
    "title": "When performance matters, skip the ORM",
    "description": "ORMs help teams move fast, but once you're tuning a hot path they add hidden latency, query chatter, and serialization overhead. Here's when to drop the abstraction, how to measure the impact, and how to ship raw SQL safely.",
    "authorGitHubUsername": "devneelpatel",
    "tags": ["Performance", "Latency", "Software Development", "DevOps"],
    "post": "2025-11-13-when-performance-matters-skip-the-orm"
  },
  {
    "title": "How to Monitor Kubernetes Clusters with OpenTelemetry and OneUptime",
    "description": "Deploy an OpenTelemetry Collector DaemonSet, stream Kubernetes metrics, logs, and traces into OneUptime, and wire dashboards plus alerts that keep clusters healthy.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Kubernetes",
      "OpenTelemetry",
      "Observability",
      "Monitoring",
      "Logs",
      "Metrics",
      "Traces"
    ],
    "post": "2025-11-14-monitor-kubernetes-clusters-with-opentelemetry-and-oneuptime"
  },
  {
    "title": "Why our Cloudflare failover failed?",
    "description": "Cloudflare's Nov 18 outage exposed the flaw in our 'just turn off the proxy' plan. Here's how the lockout happened, what the HN thread taught us, and the automation plus redundancies we're adding so we can really fail over next time.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Cloudflare", "Reliability", "Incident Management", "Security"],
    "post": "2025-11-19-why-our-cloudflare-failover-failed"
  },
  {
    "title": "How private status pages stay secure: authentication options explained",
    "description": "Layer username/password accounts, SSO + SCIM, the master password, and IP whitelisting to keep sensitive status pages restricted to trusted people and networks.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Status Page", "Security", "Identity"],
    "post": "2025-11-20-secure-your-status-page-authentication-options"
  },

  {
    "title": "10 Docker Superpowers Developers Forget to Use",
    "description": "Ten field-tested Docker techniques - from BuildKit secrets to Compose profiles - that quietly reduce image size, harden workloads, and save developer hours.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Docker", "Containers", "DevOps", "Performance", "Security"],
    "post": "2025-11-27-ten-docker-superpowers-youre-probably-not-using"
  },

  {
    "title": "Learn Docker Step by Step: A Hands-On Beginner Guide",
    "description": "A friendly walkthrough of Docker fundamentals, core terms, and one end-to-end example - from writing a Dockerfile to running a containerized web API locally.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Docker", "Containers", "Learning Resource", "DevOps"],
    "post": "2025-11-27-learn-docker-step-by-step"
  },

  {
    "title": "Learn Kubernetes Step by Step: Cluster Basics Without the Headache",
    "description": "A beginner-friendly path to Kubernetes - what the core pieces are, how they talk, and one practical Deployment plus Service example you can run today, complete with diagrams.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Kubernetes",
      "Containers",
      "Learning Resource",
      "DevOps",
      "Cloud"
    ],
    "post": "2025-11-27-learn-kubernetes-step-by-step"
  },
  {
    "title": "10 Kubernetes Superpowers Developers Overlook (and How to Use Them)",
    "description": "Ten field-tested Kubernetes capabilities - topology spread, disruption budgets, admission policies, autoscaling guardrails, and more - that instantly boost resilience, velocity, and cost control.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Kubernetes",
      "DevOps",
      "Observability",
      "Automation",
      "Security",
      "Cost Optimization"
    ],
    "post": "2025-11-27-ten-kubernetes-superpowers-developers-overlook"
  },
  {
    "title": "Choosing the Right Kubernetes Distribution: When Each Flavor Wins",
    "description": "A pragmatic guide to Kubernetes flavors-upstream DIY, managed clouds, opinionated platforms, and lightweight edge distros-with crisp heuristics on when each option is the fastest, cheapest, or safest bet.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Kubernetes",
      "Cloud",
      "Bare Metal",
      "DevOps",
      "Self-Hosting",
      "Infrastructure"
    ],
    "post": "2025-11-27-choosing-the-right-kubernetes-distribution"
  },
  {
    "title": "Choosing the Right Kubernetes Edge Flavor: Minikube vs. Kind vs. MicroK8s vs. K3s vs. KubeEdge",
    "description": "Compare minikube, Kind, MicroK8s, K3s, and KubeEdge across architecture, hardware footprint, offline behavior, and best-fit scenarios to pick the right edge distribution.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Kubernetes",
      "Edge",
      "DevOps",
      "Cloud",
      "Bare Metal",
      "Automation"
    ],
    "post": "2025-11-27-kubernetes-edge-flavors"
  },
  {
    "title": "How to Shrink and Harden Docker Images Without Breaking Builds",
    "description": "A practical playbook for cutting Docker image sizes in half while tightening security-covering multi-stage builds, distroless bases, BuildKit secrets, SBOMs, and automated policy gates.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Docker", "Security", "Performance", "DevOps", "Containers"],
    "post": "2025-11-27-shrink-and-harden-docker-images"
  },
  {
    "title": "How to Manage Environment-Specific Configs with Docker Compose Profiles",
    "description": "Structure Docker Compose files with profiles, overrides, secrets, and env layers so dev, staging, and prod share one manifest without copy/paste drift.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Docker", "DevOps", "Automation", "Environments", "Configuration"],
    "post": "2025-11-27-manage-docker-compose-profiles"
  },
  {
    "title": "How to Instrument Dockerized Apps with OpenTelemetry Sidecars and Agents",
    "description": "Step-by-step playbooks for emitting traces, metrics, and logs from containerized services using OpenTelemetry SDKs, sidecars, and node agents wired into OneUptime.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Docker",
      "OpenTelemetry",
      "Observability",
      "DevOps",
      "Monitoring"
    ],
    "post": "2025-11-27-instrument-dockerized-apps-with-opentelemetry"
  },
  {
    "title": "How to Run Production-Ready Docker Swarm Stacks",
    "description": "Design manager quorums, rolling updates, health checks, persistent volumes, and observability pipelines so Docker Swarm stays boring in production.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Docker",
      "Swarm",
      "DevOps",
      "Reliability",
      "Monitoring",
      "Automation"
    ],
    "post": "2025-11-27-production-docker-swarm"
  },
  {
    "title": "How to Plug Docker into GitHub Actions for Fast, Secure CI",
    "description": "Use BuildKit, buildx caches, Trivy scans, provenance metadata, and environment approvals to build and publish Docker images confidently from GitHub Actions.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Docker",
      "CI/CD",
      "GitHub Actions",
      "Security",
      "DevOps",
      "Automation"
    ],
    "post": "2025-11-27-docker-github-actions-ci"
  },
  {
    "title": "How to Debug Failing Docker Containers Safely",
    "description": "A disciplined workflow for investigating broken containers with inspect, logs, cp, and ephemeral shells-capturing evidence without mutating production.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Docker", "Troubleshooting", "DevOps", "Debugging", "Security"],
    "post": "2025-11-27-debug-docker-containers"
  },
  {
    "title": "How to Migrate Legacy VMs to Docker Containers",
    "description": "A seven-step plan for inventorying virtual machines, extracting dependencies, rebuilding images, migrating data, and cutting over to containers safely.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Docker", "Migration", "DevOps", "Modernization", "Automation"],
    "post": "2025-11-27-migrate-legacy-vms-to-docker"
  },
  {
    "title": "What Are Blue-Green Deployments (and When Should You Use Them)?",
    "description": "A practical explainer of blue-green deployments-mechanics, Kubernetes examples, guardrails, and when to use another rollout strategy instead.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Kubernetes", "Releases", "Reliability", "DevOps"],
    "post": "2025-11-28-what-are-blue-green-deployments"
  },
  {
    "title": "How to Install kubectl, Configure kubeconfig, and Talk to Your First Cluster",
    "description": "A zero-to-one walkthrough for installing kubectl on macOS/Linux/Windows, wiring up kubeconfig, and validating your first cluster connection in under 15 minutes.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Kubernetes", "Learning Resource", "DevOps", "Getting Started"],
    "post": "2025-11-27-install-kubectl-first-cluster"
  },
  {
    "title": "How to Create, Scale, and Delete Deployments + Services with kubectl apply",
    "description": "A practical notebook for the kubectl apply workflow-create a Deployment, expose it with a Service, scale replicas up/down, and clean up safely.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Kubernetes", "DevOps", "Learning Resource", "Getting Started"],
    "post": "2025-11-27-deploy-scale-delete"
  },
  {
    "title": "How to Use Namespaces and RBAC to Keep Dev, Stage, and Prod Isolated",
    "description": "Practical steps for carving clusters into dev/stage/prod namespaces, applying least-privilege RBAC, and verifying isolation so accidents in testing never spill into production.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Kubernetes", "DevOps", "Security", "Environments"],
    "post": "2025-11-27-namespaces-rbac-isolation"
  },
  {
    "title": "How to Add Liveness, Readiness, and Startup Probes So Kubernetes Auto-Heals Your Apps",
    "description": "Configure HTTP/TCP/command probes, validate them with kubectl, and wire alerting so the scheduler auto-heals hung Pods before users notice.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Kubernetes", "Reliability", "DevOps", "Troubleshooting"],
    "post": "2025-11-27-probes-auto-healing"
  },
  {
    "title": "How to Manage ConfigMaps and Secrets Without Leaking Credentials",
    "description": "Create, template, and mount ConfigMaps and Secrets the right way-complete with Git workflows, base64 gotchas, and external secret integrations.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Kubernetes", "Configuration", "Security", "DevOps"],
    "post": "2025-11-27-configmaps-secrets"
  },
  {
    "title": "How to Run Kubernetes Jobs and CronJobs for One-Off or Scheduled Work",
    "description": "Launch reliable Jobs for migrations, wrap them with CronJobs for schedules, and add safety nets like concurrency policies and TTL controllers.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Kubernetes", "Workloads", "Automation", "DevOps"],
    "post": "2025-11-27-jobs-cronjobs"
  },
  {
    "title": "How to Roll Out a Change, Watch Health Checks, and Undo a Bad Deploy",
    "description": "Use Deployment strategies, kubectl rollout, and health probes to ship safely-and revert instantly when something looks wrong.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Kubernetes", "Releases", "DevOps", "Reliability"],
    "post": "2025-11-27-rollouts-health-undo"
  },
  {
    "title": "How to Debug Services with kubectl Port-Forward and Inspect Ingress Traffic",
    "description": "Quickly tunnel into Pods/Services with kubectl port-forward, verify Ingress routing/TLS, and capture the signals you need when traffic misbehaves.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Kubernetes", "Troubleshooting", "Networking", "DevOps"],
    "post": "2025-11-27-port-forward-ingress-debug"
  },
  {
    "title": "How to Autoscale Deployments with the Horizontal Pod Autoscaler",
    "description": "Enable the metrics server, define resource requests, create an HPA, and load-test it so Pods scale up (and back down) automatically.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Kubernetes", "Scaling", "Performance", "DevOps"],
    "post": "2025-11-27-hpa-autoscale"
  },
  {
    "title": "How to Build a kubectl Visibility Toolkit for Fast Incident Response",
    "description": "A curated list of kubectl commands, aliases, and plugins that surface cluster health in seconds so you can answer what broke? without dashboards.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Kubernetes", "Observability", "Troubleshooting", "DevOps"],
    "post": "2025-11-27-kubectl-visibility-toolkit"
  },
  {
    "title": "How to Define and Tune Kubernetes Autoscaling for Bursty Workloads",
    "description": "A hands-on playbook for combining HPA, VPA, and Karpenter (or Cluster Autoscaler) to keep bursty workloads responsive without melting your cloud bill.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Kubernetes",
      "Autoscaling",
      "HPA",
      "VPA",
      "Karpenter",
      "SRE",
      "OneUptime"
    ],
    "post": "2025-12-02-tune-kubernetes-autoscaling-for-bursty-workloads"
  },
  {
    "title": "Why Ceph + Rook Is the Gold Standard for Bare-Metal Kubernetes Storage Pools",
    "description": "How Ceph paired with Rook turns commodity disks into a resilient, software-defined storage fabric tailor-made for bare-metal Kubernetes clusters.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Kubernetes",
      "Storage",
      "Ceph",
      "Rook",
      "Bare Metal",
      "Self-Hosting",
      "Reliability"
    ],
    "post": "2025-12-03-ceph-rook-standard-bare-metal-storage-pools"
  },
  {
    "title": "How to Upgrade Ceph and Rook with Helm (Without Scaring Your Stateful Sets)",
    "description": "A practical, battle-tested playbook for upgrading Rook and Ceph with Helm while keeping production PVCs healthy and teams calm.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Ceph",
      "Rook",
      "Kubernetes",
      "Helm",
      "Storage",
      "Bare Metal",
      "DevOps"
    ],
    "post": "2025-12-03-upgrade-ceph-rook-with-helm"
  },
  {
    "title": "Docker Compose Models Explained: Wire AI Runtimes Like Any Other Dependency",
    "description": "Docker Compose 2.38+ adds a models section so you can declare OCI-hosted AI models, gate access per service, and ship inference endpoints consistently. Here's why it matters and how to use it effectively.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Docker", "Docker Compose", "DevOps", "Configuration", "AI"],
    "post": "2025-12-03-docker-compose-models-explained"
  },
  {
    "title": "Install MetalLB with Helm on Bare-Metal Kubernetes",
    "description": "Install MetalLB with Helm, carve out safe IP pools, flip on Layer 2 or BGP advertisements, and verify LoadBalancer Services on bare-metal clusters without waiting on cloud hardware.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Kubernetes",
      "Bare Metal",
      "Helm",
      "Networking",
      "MetalLB",
      "DevOps"
    ],
    "post": "2025-12-06-install-metallb-with-helm-bare-metal"
  },
  {
    "title": "How Docker Actually Works",
    "description": "A technical-yet-friendly tour of Docker internals- OCI images, overlayfs layers, namespaces, cgroups, networking, and security hardening tips.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Docker", "Containers", "DevOps", "Security", "Performance"],
    "post": "2025-12-08-how-docker-actually-works"
  },
  {
    "title": "OCI Artifacts Explained: Beyond Container Images",
    "description": "OCI artifacts extend registry plumbing to Helm charts, SBOMs, signatures, AI models, and anything else that needs digests, provenance, and promotion workflows.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Containers", "DevOps", "Supply Chain", "Security", "OCI"],
    "post": "2025-12-08-oci-artifacts-explained"
  },
  {
    "title": "Building Your Own Container Engine in Go: A Step-by-Step Guide to Understanding Docker Internals",
    "description": "Learn how containers actually work under the hood by building a basic container engine from scratch. This hands-on guide demystifies Docker by walking through namespaces, cgroups, and filesystem isolation.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Docker", "Containers", "Linux", "DevOps", "Learning Resource"],
    "post": "2025-12-09-building-docker-from-scratch"
  },
  {
    "title": "Using eBPF with OpenTelemetry: Zero-Code Auto-Instrumentation for Any Application",
    "description": "A practical guide to combining eBPF with OpenTelemetry for automatic, zero-code distributed tracing and observability. Learn how tools like Odigos, Beyla, and OpenTelemetry eBPF work, when to use them, and how to set them up in production.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "eBPF",
      "OpenTelemetry",
      "Observability",
      "Tracing",
      "Auto-Instrumentation",
      "Kubernetes",
      "Linux",
      "Performance"
    ],
    "post": "2025-12-10-ebpf-with-opentelemetry-auto-instrumentation"
  },
  {
    "title": "What is eBPF and how does it work?",
    "description": "A comprehensive guide to eBPF (extended Berkeley Packet Filter)- what it is, how it works, why it's transforming observability and security, and how modern tools like Cilium, Falco, and continuous profilers leverage it for unprecedented system visibility.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "eBPF",
      "Linux",
      "Observability",
      "Security",
      "Networking",
      "Tracing",
      "Performance",
      "Kernel"
    ],
    "post": "2025-12-10-what-is-ebpf-and-how-does-it-work"
  },
  {
    "title": "Why a lot of software engineers don't understand networking",
    "description": "A candid look at why networking knowledge is surprisingly rare among software engineers, how this knowledge gap manifests in production systems, and why understanding the basics could make you significantly more effective.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Networking",
      "Software Development",
      "Engineering Culture",
      "Learning Resource",
      "DevOps",
      "Distributed Systems"
    ],
    "post": "2025-12-12-why-software-engineers-dont-understand-networking"
  },
  {
    "title": "One Big Server Is Probably Enough: Why You Don't Need the Cloud for Most Things",
    "description": "Modern servers are incredibly powerful and reliable. For most workloads, a single well-configured server with Docker Compose or single-node Kubernetes can get you 99.99% of the way there - at a fraction of the cloud cost.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Infrastructure",
      "Cloud",
      "Cost Optimization",
      "Bare Metal",
      "Docker",
      "Kubernetes",
      "DevOps",
      "Scaling",
      "Self-Hosting"
    ],
    "post": "2025-12-12-one-big-server-is-enough"
  },
  {
    "title": "How to Use NAS Storage with Kubernetes: NFS, SMB, and iSCSI Volumes",
    "description": "A practical guide to connecting your NAS (Synology, QNAP, TrueNAS, or any NFS/SMB/iSCSI server) to Kubernetes clusters. Learn how to provision persistent volumes, set up dynamic provisioning with CSI drivers, and avoid common pitfalls.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Kubernetes",
      "Storage",
      "NFS",
      "DevOps",
      "Bare Metal",
      "Self-Hosting"
    ],
    "post": "2025-12-15-how-to-use-nas-storage-with-kubernetes"
  },
  {
    "title": "How to Use NAS Storage with Docker Compose: NFS, SMB, and Local Volumes",
    "description": "A practical guide to connecting your NAS (Synology, QNAP, TrueNAS, or any NFS/SMB server) to Docker Compose stacks. Learn how to mount network shares as volumes, configure permissions, and avoid common pitfalls.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": [
      "Docker",
      "Docker Compose",
      "Storage",
      "NFS",
      "DevOps",
      "Self-Hosting"
    ],
    "post": "2025-12-15-how-to-use-nas-storage-with-docker-compose"
  },
  {
    "title": "What is KEDA and How to Implement It in Kubernetes",
    "description": "Learn what KEDA (Kubernetes Event-Driven Autoscaling) is, why it matters, and how to implement it in your Kubernetes cluster for event-driven, production-grade autoscaling.",
    "authorGitHubUsername": "nawazdhandala",
    "tags": ["Kubernetes", "KEDA", "Autoscaling", "DevOps", "Cloud Native"],
    "post": "2025-12-15-what-is-keda-and-how-to-implement-in-kubernetes"
  }
    ,
    {
      "title": "What is Istio in Kubernetes and Why Do We Need It?",
      "description": "Discover what Istio is, how it works in Kubernetes, and why modern cloud-native applications benefit from a service mesh for observability, security, and traffic management.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": [
        "Kubernetes",
        "Istio",
        "Service Mesh",
        "DevOps",
        "Cloud Native",
        "Networking",
        "Security"
      ],
      "post": "2025-12-15-what-is-istio-in-kubernetes-and-why-do-we-need-it"
    },
    {
      "title": "What is Canary Deployment and How to Implement It in Kubernetes",
      "description": "Learn what canary deployments are, why they're essential for safe releases, and how to implement them in Kubernetes using native features and Istio for traffic splitting.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": [
        "Kubernetes",
        "Canary Deployment",
        "Releases",
        "DevOps",
        "Reliability",
        "Cloud Native"
      ],
      "post": "2025-12-15-what-is-canary-deployment-and-how-to-implement-it"
    },
    {
      "title": "What is containerd and Why Do We Need It?",
      "description": "Learn what containerd is, how it differs from Docker, why Kubernetes adopted it as the default runtime, and when you should care about container runtimes.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": [
        "Containers",
        "containerd",
        "Docker",
        "Kubernetes",
        "DevOps",
        "Container Runtime"
      ],
      "post": "2025-12-15-what-is-containerd-and-why-do-we-need-it"
    },
    {
      "title": "What is PKCE and Why You Need It?",
      "description": "Learn what PKCE (Proof Key for Code Exchange) is, how it protects OAuth 2.0 authorization flows from interception attacks, and why modern applications should implement it.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": [
        "Security",
        "OAuth",
        "Authentication",
        "PKCE",
        "API"
      ],
      "post": "2025-12-16-what-is-pkce-and-why-you-need-it"
    },
    {
      "title": "What is OAuth and How Does It Work?",
      "description": "Learn what OAuth 2.0 is, how it works under the hood, and how to implement it in a Node.js application with a practical example.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": [
        "OAuth",
        "Authentication",
        "Security",
        "NodeJS",
        "API"
      ],
      "post": "2025-12-16-what-is-oauth-and-how-does-it-work"
    },
    {
      "title": "OpenTelemetry for Python Applications: Django, FastAPI, and Flask",
      "description": "Complete guide to instrumenting Python applications with OpenTelemetry, covering Django, FastAPI, Flask, and async frameworks with practical code examples.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": ["OpenTelemetry", "Python", "Django", "FastAPI", "Flask", "Distributed Tracing"],
      "post": "2025-12-17-opentelemetry-python-instrumentation"
    },
    {
      "title": "OpenTelemetry for Go Services: A Complete Instrumentation Guide",
      "description": "Learn how to instrument Go applications with OpenTelemetry, covering HTTP servers, gRPC services, database operations, and custom spans with idiomatic Go patterns.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": ["OpenTelemetry", "Go", "Golang", "Distributed Tracing", "Observability"],
      "post": "2025-12-17-opentelemetry-go-instrumentation"
    },
    {
      "title": "OpenTelemetry for Java and Spring Boot Applications",
      "description": "Comprehensive guide to instrumenting Java and Spring Boot applications with OpenTelemetry, covering auto-instrumentation, manual spans, and production configuration.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": ["OpenTelemetry", "Java", "Spring Boot", "Distributed Tracing", "Observability"],
      "post": "2025-12-17-opentelemetry-java-spring-boot"
    },
    {
      "title": "OpenTelemetry for .NET Applications: ASP.NET Core and Beyond",
      "description": "Complete guide to instrumenting .NET and ASP.NET Core applications with OpenTelemetry, covering automatic and manual instrumentation, configuration, and best practices.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": ["OpenTelemetry", ".NET", "ASP.NET Core", "C#", "Distributed Tracing"],
      "post": "2025-12-17-opentelemetry-dotnet-instrumentation"
    },
    {
      "title": "OTLP Protocol Explained: The Wire Format Behind OpenTelemetry",
      "description": "Deep dive into OTLP (OpenTelemetry Protocol), understanding the wire format, transport options, protobuf schemas, and how to optimize data transmission.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": ["OpenTelemetry", "OTLP", "Protocol", "Distributed Tracing", "Observability"],
      "post": "2025-12-17-opentelemetry-otlp-protocol-explained"
    },
    {
      "title": "OpenTelemetry Semantic Conventions: Standardizing Your Telemetry",
      "description": "Master OpenTelemetry semantic conventions for consistent, interoperable telemetry data across your entire stack, including HTTP, database, messaging, and custom conventions.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": ["OpenTelemetry", "Semantic Conventions", "Standards", "Observability"],
      "post": "2025-12-17-opentelemetry-semantic-conventions"
    },
    {
      "title": "Resource Detection in OpenTelemetry: Automatic Environment Discovery",
      "description": "Learn how OpenTelemetry resource detection automatically discovers cloud environments, Kubernetes metadata, and infrastructure details to enrich your telemetry.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": ["OpenTelemetry", "Resource Detection", "Kubernetes", "Cloud", "AWS", "GCP", "Azure"],
      "post": "2025-12-17-opentelemetry-resource-detection"
    },
    {
      "title": "Baggage Propagation in OpenTelemetry: Passing Context Across Services",
      "description": "Master OpenTelemetry baggage for propagating business context across service boundaries, enabling powerful debugging and request correlation capabilities.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": ["OpenTelemetry", "Baggage", "Context Propagation", "Distributed Tracing"],
      "post": "2025-12-17-opentelemetry-baggage-propagation"
    },
    {
      "title": "OpenTelemetry for Serverless: AWS Lambda, Azure Functions, and Cloud Functions",
      "description": "Comprehensive guide to instrumenting serverless functions with OpenTelemetry, covering AWS Lambda, Azure Functions, and Google Cloud Functions with cold start optimization.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": ["OpenTelemetry", "Serverless", "AWS Lambda", "Azure Functions", "Cloud Functions"],
      "post": "2025-12-17-opentelemetry-serverless"
    },
    {
      "title": "Database Tracing with OpenTelemetry: SQL, NoSQL, and ORM Instrumentation",
      "description": "Learn how to instrument database operations with OpenTelemetry, covering PostgreSQL, MySQL, MongoDB, Redis, and popular ORMs like Prisma and TypeORM.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": ["OpenTelemetry", "Database", "SQL", "MongoDB", "PostgreSQL", "Distributed Tracing"],
      "post": "2025-12-17-opentelemetry-database-tracing"
    },
    {
      "title": "gRPC Tracing with OpenTelemetry: Complete Instrumentation Guide",
      "description": "Master gRPC distributed tracing with OpenTelemetry across Node.js, Go, Python, and Java, including interceptors, metadata propagation, and streaming RPCs.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": ["OpenTelemetry", "gRPC", "Distributed Tracing", "Microservices"],
      "post": "2025-12-17-opentelemetry-grpc-tracing"
    },
    {
      "title": "OpenTelemetry with Service Mesh: Istio, Linkerd, and Beyond",
      "description": "Learn how to integrate OpenTelemetry with service meshes like Istio and Linkerd for comprehensive distributed tracing in microservices architectures.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": ["OpenTelemetry", "Service Mesh", "Istio", "Linkerd", "Distributed Tracing", "Kubernetes"],
      "post": "2025-12-17-opentelemetry-service-mesh"
    },
    {
      "title": "OpenTelemetry Operator for Kubernetes: Automated Instrumentation at Scale",
      "description": "Master the OpenTelemetry Operator for Kubernetes to achieve zero-code instrumentation, automatic sidecar injection, and scalable observability management.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": ["OpenTelemetry", "Kubernetes", "Operator", "Auto-instrumentation", "Cloud Native"],
      "post": "2025-12-17-opentelemetry-operator-kubernetes"
    },
    {
      "title": "Browser and Frontend Instrumentation with OpenTelemetry",
      "description": "Implement end-to-end distributed tracing from browser to backend using OpenTelemetry Web SDK, including Real User Monitoring and Core Web Vitals.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": ["OpenTelemetry", "Browser", "Frontend", "JavaScript", "RUM", "Web Vitals"],
      "post": "2025-12-17-opentelemetry-browser-frontend"
    },
    {
      "title": "Message Queue Tracing with OpenTelemetry: Kafka, RabbitMQ, and SQS",
      "description": "Implement distributed tracing for message queues and event-driven architectures using OpenTelemetry, covering Kafka, RabbitMQ, AWS SQS, and more.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": ["OpenTelemetry", "Message Queues", "Kafka", "RabbitMQ", "SQS", "Event-Driven"],
      "post": "2025-12-17-opentelemetry-message-queue-tracing"
    },
    {
      "title": "Redis and Cache Instrumentation with OpenTelemetry",
      "description": "Learn how to instrument Redis, Memcached, and other caching systems with OpenTelemetry for complete visibility into cache performance and hit rates.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": ["OpenTelemetry", "Redis", "Caching", "Memcached", "Performance"],
      "post": "2025-12-17-opentelemetry-redis-cache-instrumentation"
    },
    {
      "title": "Span Links vs Parent-Child Relationships in OpenTelemetry",
      "description": "Understand when to use span links versus parent-child relationships in OpenTelemetry for accurate trace modeling in complex distributed systems.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": ["OpenTelemetry", "Distributed Tracing", "Span Links", "Trace Context"],
      "post": "2025-12-17-opentelemetry-span-links-vs-parent-child"
    },
    {
      "title": "Trace-Based Testing with OpenTelemetry",
      "description": "Learn how to use OpenTelemetry traces for automated testing, validating distributed system behavior, and ensuring observability in your CI/CD pipeline.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": ["OpenTelemetry", "Testing", "Tracetest", "Quality Assurance", "CI/CD"],
      "post": "2025-12-17-opentelemetry-trace-based-testing"
    },
    {
      "title": "OpenTelemetry for GraphQL APIs: Complete Instrumentation Guide",
      "description": "Learn how to instrument GraphQL APIs with OpenTelemetry, including resolver tracing, query complexity monitoring, and N+1 detection across Apollo Server and GraphQL Yoga.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": ["OpenTelemetry", "GraphQL", "Apollo", "Distributed Tracing", "API Observability"],
      "post": "2025-12-17-opentelemetry-graphql-apis"
    },
    {
      "title": "Continuous Profiling with OpenTelemetry: Linking Profiles to Traces",
      "description": "Learn how to implement continuous profiling with OpenTelemetry, correlate profiles with traces, and identify performance bottlenecks at the code level.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": ["OpenTelemetry", "Continuous Profiling", "Performance", "CPU Profiling", "Memory Profiling"],
      "post": "2025-12-17-opentelemetry-continuous-profiling"
    },
    {
      "title": "CI/CD Pipeline Observability with OpenTelemetry",
      "description": "Implement observability for your CI/CD pipelines using OpenTelemetry, tracking build times, test results, deployment status, and correlating pipeline runs with production traces.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": ["OpenTelemetry", "CI/CD", "DevOps", "GitHub Actions", "Jenkins", "Pipeline Observability"],
      "post": "2025-12-17-opentelemetry-cicd-observability"
    },
    {
      "title": "Multi-Cluster Tracing with OpenTelemetry",
      "description": "Implement distributed tracing across multiple Kubernetes clusters using OpenTelemetry, handling cross-cluster context propagation, collector federation, and unified observability.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": ["OpenTelemetry", "Kubernetes", "Multi-Cluster", "Distributed Tracing", "Federation"],
      "post": "2025-12-17-opentelemetry-multi-cluster-tracing"
    },
    {
      "title": "Migrating from Jaeger to OpenTelemetry",
      "description": "A complete guide to migrating from Jaeger client libraries to OpenTelemetry SDKs while maintaining backward compatibility and minimizing disruption.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": ["OpenTelemetry", "Jaeger", "Migration", "Distributed Tracing"],
      "post": "2025-12-17-migrating-jaeger-to-opentelemetry"
    },
    {
      "title": "Migrating from Zipkin to OpenTelemetry",
      "description": "Step-by-step guide to migrating from Zipkin tracing to OpenTelemetry, covering Brave instrumentation replacement, collector setup, and backward compatibility.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": ["OpenTelemetry", "Zipkin", "Migration", "Distributed Tracing"],
      "post": "2025-12-17-migrating-zipkin-to-opentelemetry"
    },
    {
      "title": "OpenTelemetry vs Proprietary APM: A Comprehensive Comparison",
      "description": "Compare OpenTelemetry with proprietary APM solutions like Datadog, New Relic, and Dynatrace. Understand the trade-offs in cost, flexibility, features, and long-term strategy.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": ["OpenTelemetry", "APM", "Vendor Lock-in", "Observability", "Comparison"],
      "post": "2025-12-17-opentelemetry-vs-proprietary-apm"
    },
    {
      "title": "Security Considerations in OpenTelemetry: Protecting Your Telemetry Data",
      "description": "Learn how to secure your OpenTelemetry implementation. Cover PII scrubbing, data encryption, authentication, authorization, and security best practices for telemetry pipelines.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": ["OpenTelemetry", "Security", "Data Privacy", "PII", "Encryption", "Best Practices"],
      "post": "2025-12-17-opentelemetry-security-considerations"
    },
    {
      "title": "Performance Impact of OpenTelemetry: Benchmarks and Optimization",
      "description": "Understand the real performance impact of OpenTelemetry instrumentation. Learn benchmarking techniques, optimization strategies, and how to minimize overhead in production.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": ["OpenTelemetry", "Performance", "Benchmarking", "Optimization", "CPU", "Memory"],
      "post": "2025-12-17-opentelemetry-performance-impact"
    },
    {
      "title": "OpenTelemetry in High-Throughput Systems: Scaling to Millions of Spans",
      "description": "Learn how to implement OpenTelemetry in high-throughput systems processing millions of requests. Covers sampling strategies, collector scaling, backpressure handling, and architecture patterns.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": ["OpenTelemetry", "High-Throughput", "Scaling", "Performance", "Architecture", "Sampling"],
      "post": "2025-12-17-opentelemetry-high-throughput-systems"
    },
    {
      "title": "OpenTelemetry Collector Pipelines Deep Dive: Architecture and Configuration",
      "description": "Master OpenTelemetry Collector pipelines with this deep dive into receivers, processors, exporters, and connectors. Learn advanced configuration patterns and best practices.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": ["OpenTelemetry", "Collector", "Pipelines", "Configuration", "Architecture", "Processors"],
      "post": "2025-12-17-opentelemetry-collector-pipelines"
    },
    {
      "title": "Why Vendor-Neutral CI/CD matters: Why Bash Scripts Beat Platform Lock-In",
      "description": "Build portable CI/CD pipelines by putting your logic in bash scripts instead of vendor-specific syntax. When platforms change pricing, policies, or disappear entirely, migrate in hours instead of weeks.",
      "authorGitHubUsername": "nawazdhandala",
      "tags": [
        "CI/CD",
        "DevOps",
        "Bash",
        "Vendor Lock-in",
        "Automation",
        "GitHub Actions",
        "GitLab CI",
        "Jenkins"
      ],
      "post": "2025-12-17-vendor-neutral-cicd-pipelines"
    }
]
